#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
tfe_workspace.iac_ws["iac-azure-resources"]: Refreshing state... [id=ws-zj7feQucod5mRUag]
module.azdo_terraform_pipeline_templates.github_repository.repo: Refreshing state... [id=azdo-terraform-pipeline-templates]
github_actions_secret.tf_api_token["terraform-module-scaffolding"]: Refreshing state... [id=terraform-module-scaffolding:TF_API_TOKEN]
module.terraform_module_repos["terraform-module-scaffolding"].github_repository.repo: Refreshing state... [id=terraform-module-scaffolding]
module.ansible_roles["ansible-role-k8s-certificates"].github_repository.repo: Refreshing state... [id=ansible-role-k8s-certificates]
module.ansible_roles["ansible-role-k8s-node"].github_repository.repo: Refreshing state... [id=ansible-role-k8s-node]
github_actions_secret.tf_api_token["iac-azure-resources"]: Refreshing state... [id=iac-azure-resources:TF_API_TOKEN]
module.ansible_roles["ansible-role-cryptominer"].github_repository.repo: Refreshing state... [id=ansible-role-cryptominer]
module.ansible_roles["ansible-role-terraform"].github_repository.repo: Refreshing state... [id=ansible-role-terraform]
module.ansible_roles["ansible-role-kubetools"].github_repository.repo: Refreshing state... [id=ansible-role-kubetools]
module.ansible_roles["ansible-role-zsh"].github_repository.repo: Refreshing state... [id=ansible-role-zsh]
module.ansible_roles["ansible-role-git"].github_repository.repo: Refreshing state... [id=ansible-role-git]
module.iac_repos["iac-azure-resources"].github_repository.repo: Refreshing state... [id=iac-azure-resources]
module.ansible_roles["ansible-role-docker"].github_repository.repo: Refreshing state... [id=ansible-role-docker]
module.ansible_roles["ansible-role-vagrant"].github_repository.repo: Refreshing state... [id=ansible-role-vagrant]
module.iac_github_mgmt.github_repository.repo: Refreshing state... [id=iac-github-mgmt]
github_user_ssh_key.ssh_key_cultclassik: Refreshing state... [id=54706683]
module.diehlabs_terraform_module_repos["terraform-azurerm-o365dns"].github_repository.repo: Refreshing state... [id=terraform-azurerm-o365dns]
module.ansible_control.github_repository.repo: Refreshing state... [id=ansible-control]
module.github_action_templates.github_repository.repo: Refreshing state... [id=.github]
module.diehlabs_terraform_module_repos["terraform-azurerm-o365dns"].github_branch_default.default: Refreshing state... [id=terraform-azurerm-o365dns]
module.github_action_templates.github_branch_default.default: Refreshing state... [id=.github]
module.terraform_module_repos["terraform-module-scaffolding"].github_branch_default.default: Refreshing state... [id=terraform-module-scaffolding]
module.azdo_terraform_pipeline_templates.github_branch_default.default: Refreshing state... [id=azdo-terraform-pipeline-templates]
module.iac_repos["iac-azure-resources"].github_branch_default.default: Refreshing state... [id=iac-azure-resources]
tfe_workspace.iac_github_mgmt: Refreshing state... [id=ws-MyypkggTqKQ9xbSY]
module.ansible_roles["ansible-role-kubetools"].github_branch_default.default: Refreshing state... [id=ansible-role-kubetools]
module.ansible_roles["ansible-role-terraform"].github_branch_default.default: Refreshing state... [id=ansible-role-terraform]
module.ansible_roles["ansible-role-zsh"].github_branch_default.default: Refreshing state... [id=ansible-role-zsh]
module.ansible_roles["ansible-role-vagrant"].github_branch_default.default: Refreshing state... [id=ansible-role-vagrant]
module.ansible_roles["ansible-role-cryptominer"].github_branch_default.default: Refreshing state... [id=ansible-role-cryptominer]
module.ansible_roles["ansible-role-git"].github_branch_default.default: Refreshing state... [id=ansible-role-git]
module.ansible_roles["ansible-role-k8s-certificates"].github_branch_default.default: Refreshing state... [id=ansible-role-k8s-certificates]
module.ansible_roles["ansible-role-k8s-node"].github_branch_default.default: Refreshing state... [id=ansible-role-k8s-node]
module.ansible_roles["ansible-role-docker"].github_branch_default.default: Refreshing state... [id=ansible-role-docker]
module.ansible_control.github_branch_default.default: Refreshing state... [id=ansible-control]
module.iac_github_mgmt.github_branch_default.default: Refreshing state... [id=iac-github-mgmt]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # tfe_workspace.iac_github_mgmt has been changed
  ~ resource "tfe_workspace" "iac_github_mgmt" {
        id                            = "ws-MyypkggTqKQ9xbSY"
        name                          = "iac-github-mgmt"
      ~ tag_names                     = [
          - "Github",
          - "Production",
          + "github",
          + "production",
        ]
        # (13 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # github_actions_secret.iac_github_mgmt_tftoken will be created
  + resource "github_actions_secret" "iac_github_mgmt_tftoken" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "iac-github-mgmt"
      + secret_name     = "TF_API_TOKEN"
      + updated_at      = (known after apply)
    }

  # tfe_workspace.iac_github_mgmt will be updated in-place
  ~ resource "tfe_workspace" "iac_github_mgmt" {
        id                            = "ws-MyypkggTqKQ9xbSY"
        name                          = "iac-github-mgmt"
      ~ tag_names                     = [
          + "app",
          - "github",
          - "production",
          + "test",
        ]
        # (13 unchanged attributes hidden)
    }

  # module.github_shared_workflows.data.github_branch.main will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "main"  {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "shared-workflows"
      + sha        = (known after apply)
    }

  # module.github_shared_workflows.github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "shared-workflows"
    }

  # module.github_shared_workflows.github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Github Shared Workflows - Repo managed by Terraform"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "shared-workflows"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @CultClassik, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Configuration Run`*